{
  "agendas": [
    {
      "id": "battlefield_survivors",
      "name": "Battlefield Survivors",
      "type": "objective",
      "description": "Select up to 3 units at battle start. At battle end: if a selected unit was not destroyed, it gains 2XP. If it was also not Below Half-strength, it gains 1 additional XP (3XP total).",
      "maxTier": 2,
      "maxUnits": 3,
      "xpPerTier": 2
    },
    {
      "id": "swarm_the_planet",
      "name": "Swarm the Planet",
      "type": "objective",
      "description": "At battle end, for each table quarter you control (more of your units wholly within it than opponent's), select one of your units there to gain 2XP. Up to 4 quarters can be controlled.",
      "maxTier": 1,
      "maxUnits": 4,
      "xpPerTier": 2
    },
    {
      "id": "headhunters",
      "name": "Headhunters",
      "type": "tally",
      "description": "Each time one of your models destroys an enemy CHARACTER unit, its unit gains 2XP. If the destroyed CHARACTER was the enemy Warlord, it gains 4XP instead.",
      "xpPerTally": 2
    },
    {
      "id": "monstrous_targets",
      "name": "Monstrous Targets",
      "type": "tally",
      "description": "Each time one of your models destroys an enemy MONSTER or VEHICLE unit (excluding Dedicated Transports), its unit gains 2XP. If the destroyed unit had the TITANIC keyword, it gains 4XP instead.",
      "xpPerTally": 2
    },
    {
      "id": "eradicate_the_swarm",
      "name": "Eradicate the Swarm",
      "type": "tally",
      "description": "Each time one of your units shoots or fights and destroys 6 or more enemy models in that phase, it gains 1XP.",
      "xpPerTally": 1
    },
    {
      "id": "critical_objectives",
      "name": "Critical Objectives",
      "type": "objective",
      "description": "Your opponent selects 2 objectives before battle. At battle end, if you control one of those objectives, select up to 3 of your units within range of it to each gain 2XP.",
      "maxTier": 1,
      "maxUnits": 3,
      "xpPerTier": 2
    },
    {
      "id": "drive_home_the_blade",
      "name": "Drive Home the Blade",
      "type": "objective",
      "description": "At battle end, select up to 3 non-AIRCRAFT units that are wholly within 6\" of your opponent's battlefield edge (or deployment zone if no edge). Each selected unit gains 3XP.",
      "maxTier": 1,
      "maxUnits": 3,
      "xpPerTier": 3
    },
    {
      "id": "cleanse_infestation",
      "name": "Cleanse Infestation",
      "type": "tally",
      "description": "Before shooting, task a non-Battle-shocked unit to cleanse (cannot shoot or charge that turn). At end of turn, if that unit is in range of a controlled infested objective, cleanse it and gain 2XP.",
      "xpPerTally": 2
    },
    {
      "id": "forward_observers",
      "name": "Forward Observers",
      "type": "tally",
      "description": "Before shooting, task a non-Battle-shocked unit that Remained Stationary to recon (cannot shoot or charge). At end of opponent's next turn (or battle end), if wholly in opponent's deployment zone, gain 2XP + 1CP.",
      "xpPerTally": 2
    },
    {
      "id": "recover_mission_archives",
      "name": "Recover Mission Archives",
      "type": "tally",
      "description": "Before shooting, task an INFANTRY or MOUNTED non-Battle-shocked unit to recover (cannot shoot or charge). At turn end, if in range of controlled objective outside your deployment zone, roll D6: 4-5 = 1XP, 6 = 2XP + 1CP.",
      "xpPerTally": 1
    },
    {
      "id": "malefic_hunter",
      "name": "Malefic Hunter",
      "type": "tally",
      "description": "Each time one of your models destroys an enemy PSYKER or SYNAPSE unit, its unit gains 1XP. If the destroyed unit was also a CHARACTER, it gains 1 additional XP (2XP total).",
      "xpPerTally": 1
    },
    {
      "id": "test_of_faith",
      "name": "Test of Faith",
      "type": "tally",
      "description": "Each time a unit performs an Act of Faith, you may discard 1 additional Miracle dice and place it on that unit's card. If a unit fails a Battle-shock test, remove all dice from its card. At battle end, each unit gains 1XP per Miracle dice on its card (max 3XP). SAINT POTENTIA models also gain 1 Saint point.",
      "faction": "Adepta Sororitas",
      "xpPerTally": 1,
      "maxXp": 3
    },
    {
      "id": "atonement_in_battle",
      "name": "Atonement in Battle",
      "type": "objective",
      "description": "Select up to 3 ADEPTA SORORITAS units that are PENITENT or have Fatigued/Disgraced/Mark of Shame/Battle-weary scars. At battle end, each that destroyed 1+ enemy units gains 3XP, loses one listed scar, and REPENTIA SQUAD gains 1 Redemption point.",
      "faction": "Adepta Sororitas",
      "maxTier": 1,
      "maxUnits": 3,
      "xpPerTier": 3
    },
    {
      "id": "defend_the_shrine",
      "name": "Defend the Shrine",
      "type": "tally",
      "description": "After deployment, opponent selects 1 objective (not in their zone) as Sacred Shrine. Each turn you control it, select 1 unit in range for 1XP. At battle end: if not controlled, lose 1 Requisition point; if controlled, select 1 model for a Weapon Modification, Crusade Relic (Characters), or 3 Saint points (Potentia).",
      "faction": "Adepta Sororitas",
      "xpPerTally": 1
    },
    {
      "id": "pious_purgation",
      "name": "Pious Purgation",
      "type": "tally",
      "description": "Each time an ADEPTA SORORITAS unit shoots/fights and destroys 1+ enemy units, it gains 1XP. +1XP if any destroyed were PSYKER; +1XP if destroyed by Torrent or Melta weapon (max 3XP per unit). SAINT POTENTIA gains +1 Saint point if any XP earned.",
      "faction": "Adepta Sororitas",
      "xpPerTally": 1,
      "maxXp": 3
    }
  ]
}
